# 3 დაწერე ფუნქცია (ფიბონაჩის რიგი) - *რა არის ფიბონაჩი - ბოლო ორი ელემენტის ჯამით ვამატებთ ახალ რიცხვს*, სანამ სიგრძე არ გახდება მომხმარებლის მიერ შემოყვანილი რიცხვი, აუცილებლად უნდა შემოიტანოს რიცხვი, სხვა რამის შემოტანის დროს უნდა შემოწმდეს რა შემოიტანა მომხმარებელმა და უნდა დაუსახელო აღნიშნული და უთხრა რომ მხოლოდ რიცხვი შემოიტანოს. მაგ: შემოიტანა სიმბოლო, უნდა უთხრა შენ შემოიტანე სიმბოლო არასწორია, მხოლოდ რიცხვი!

def fib_mim(n):
    fib = [0, 1]
    while len(fib) < n:
        fib.append(fib[-1] + fib[-2])
    return fib[:n]


while True:
    user_input = input("შეიყვანე რიცხვი (ფიბონაჩის თანმიმდევრობის სიგრძე): ")

    if user_input.isdigit():
        n = int(user_input)
        if n <= 0:
            print(f"გთხოვთ შეიყვანე 0-ზე მეტი მნიშვნელობა!")
        else:
            print(f"ფიბონაჩის რიგი ({n} სიგრძით): {fib_mim(n)}")
            break
    else:
        print("შენ შემოიტანე სიმბოლო, არასწორია!!! მხოლოდ რიცხვი!")
